BEGIN;
INSERT INTO public.specialties  (code, "name",kf_code, knowledge_field) VALUES
    ('121', 'Інженерія програмного забезпечення', '12', 'Інформаційні технології'),
    ('122', 'Комп’ютерні науки', '12', 'Інформаційні технології'),
    ('123', 'Комп’ютерна інженерія', '12', 'Інформаційні технології'),
    ('124', 'Системний аналіз', '12', 'Інформаційні технології'),
    ('125', 'Кібербезпека', '12', 'Інформаційні технології'),
    ('126', 'Інформаційні системи та технології', '12', 'Інформаційні технології'),
    ('141','Електроенергетика, електротехніка та електромеханіка','14','Електрична інженерія'),
    ('142','Енергетичне машинобудування','14','Електрична інженерія'),
    ('143','Атомна енергетика','14','Електрична інженерія'),
    ('144','Теплоенергетика','14','Електрична інженерія'),
    ('145','Гідроенергетика','14','Електрична інженерія');
COMMIT;
