BEGIN;
INSERT INTO public.competencies_base (type, definition, specialty) VALUES
    ('ЗК','Здатність до абстрактного мислення, аналізу та синтезу','121'),
    ('ЗК','Здатність до застосовування загально-наукових та фундаментальних знань, розуміння предмету інженері програмного забезпечення у практичних ситуаціях. ','121'),
    ('ЗК','Здатність здійснювати усну і письмову комунікацію професійного спрямування рідною та іноземною мовами. ','121'),
    ('ЗК','Навички використання інформаційних і комунікаційних технологій з метою пошуку, оброблення та аналізу інформації з різних джерел. ','121'),
    ('ЗК','Здатність працювати в команді. ','121'),
    ('ЗК','Здатність вчитися та оволодівати сучасними знаннями та проводити самостійні дослідження на відповідному рівні. ','121'),
    ('ЗК','Здатність до пошуку, оброблення та аналізу інформації з різних джерел. ','121'),
    ('ЗК','Здатність використовувати сучасні методології управління проектною розробкою програмного забезпечення. ','121'),
    ('ЗК','Здатність діяти на основі етичних міркувань. ','121'),
    ('ЗК','Прагнення до збереження навколишнього середовища. ','121'),
    ('ЗК','Здатність діяти соціально відповідально та свідомо, ','121'),
    ('ЗК','Здатність реалізувати свої права та обов''язки як члена суспільства, усвідомлювати цінності громадянського (вільного демократичного) суспільства та необхідність його сталого розвитку, верховенства права, прав і свобод людини і громадянина в Україні. ','121'),
    ('ЗК','Здатність зберігати та примножувати моральні, культурні, наукові цінності і досягнення суспільства на основі розуміння історії та закономірностей розвитку предметної області, її місця У загальній системі знань про природу і суспільство та у розвитку суспільства, техніки і технологій, використовувати різні види та форми рухової активності для активного відпочинку та ведення здорового способу життя. ','121');
COMMIT;